public class Vector01
{
    //向量
    //·向量没有位置，只有大小和方向
    //·向量的箭头是向量的结束点，尾巴是向量的起始点
    //·向量描述的位移能被认为是与轴平行的位移序列
    //·向量表示：三维（ax，ay，az） 二维（ax，ay）

    //向量与标量
    //·向量：有大小和方向的有向线段
    //·标量：只有大小，没有方向的量 

    //向量与点
    //·向量和点数学形式上相等，但几何意义完全不同
    //·点：有位置，没有实际大小或方向
    //·向量：无位置，有实际大小和方向
    //·联系：任何一个点都可以看作是从原点出发的向量

    //零向量
    //·零向量是唯一大小为零的向量
    //·零向量是唯一一个没有方向的量
    //·零向量不是一个点，疑问没有定义某个位置
    //·零向量表示的是没有位移，就像零标量表示的是没有数量一样

    //点积(点乘)
    //A:(1,2)  B:(2,1)
    // A*B      角度         a和b
    // >0   0<=角度<90   方向基本相同
    // =0    角度<=90        正交
    // <0  90<=角度<180  方向基本相反
}
